MoeMengMoe/stm32-caring-system-project/esp8266_firmware/src/main.cpp
#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <PubSubClient.h>

// TODO(Simon): Replace these values before uploading.
static const char *WIFI_SSID = "Cudy-E5A6";
static const char *WIFI_PASSWORD = "405405405";
static const char *MQTT_HOST = "192.168.10.249";
static const uint16_t MQTT_PORT = 1883;

static const char *NODE_ID = "node01";

static const bool ENABLE_FAKE_DATA = false;
static const unsigned long FAKE_PUBLISH_INTERVAL_MS = 5000UL;
static const unsigned long WIFI_RETRY_INTERVAL_MS = 5000UL;
static const unsigned long MQTT_RETRY_INTERVAL_MS = 2000UL;
static const size_t UART_LINE_MAX_LEN = 192;
static const size_t MQTT_PAYLOAD_MAX_LEN = 384;

static WiFiClient wifi_client;
static PubSubClient mqtt_client(wifi_client);

static char mqtt_client_id[32];
static char mqtt_topic_status[64];
static char mqtt_topic_event[64];
static char mqtt_topic_availability[64];
static char mqtt_topic_demo_command[64];
static char mqtt_topic_demo_state[64];
static char mqtt_topic_relay_set[4][64];
static char mqtt_topic_relay_state[4][64];
static char mqtt_topic_relay_result[4][64];

static unsigned long last_publish_ms = 0;
static unsigned long last_wifi_attempt_ms = 0;
static unsigned long last_mqtt_attempt_ms = 0;
static bool wifi_begin_called = false;
static uint32_t fake_seq = 0;
static uint32_t last_uart_seq = 0;
static uint32_t next_gateway_request_id = 1;
static bool has_last_uart_seq = false;
static char uart_line[UART_LINE_MAX_LEN];
static size_t uart_line_len = 0;

static void build_mqtt_names(void) {
  snprintf(mqtt_client_id, sizeof(mqtt_client_id), "eldercare-%s", NODE_ID);
  snprintf(mqtt_topic_status, sizeof(mqtt_topic_status), "eldercare/%s/status", NODE_ID);
  snprintf(mqtt_topic_event, sizeof(mqtt_topic_event), "eldercare/%s/event", NODE_ID);
  snprintf(mqtt_topic_availability, sizeof(mqtt_topic_availability), "eldercare/%s/availability", NODE_ID);
  snprintf(mqtt_topic_demo_command,
           sizeof(mqtt_topic_demo_command),
           "eldercare/%s/demo/command",
           NODE_ID);
  snprintf(mqtt_topic_demo_state, sizeof(mqtt_topic_demo_state), "eldercare/%s/demo/state", NODE_ID);

  for (uint8_t relay = 1; relay <= 4; relay++) {
    snprintf(mqtt_topic_relay_set[relay - 1],
             sizeof(mqtt_topic_relay_set[relay - 1]),
             "eldercare/%s/relay/%u/set",
             NODE_ID,
             relay);
    snprintf(mqtt_topic_relay_state[relay - 1],
             sizeof(mqtt_topic_relay_state[relay - 1]),
             "eldercare/%s/relay/%u/state",
             NODE_ID,
             relay);
    snprintf(mqtt_topic_relay_result[relay - 1],
             sizeof(mqtt_topic_relay_result[relay - 1]),
             "eldercare/%s/relay/%u/result",
             NODE_ID,
             relay);
  }
}

static const char *scenario_to_text(const int scenario) {
  switch (scenario) {
    case 0:
      return "NONE";
    case 1:
      return "SOS_OR_FALL_SIM";
    case 2:
      return "LONG_STILL_NO_RESPONSE";
    case 3:
      return "OFFLINE_AUTONOMY";
    default:
      return "UNKNOWN";
  }
}

static const char *event_type_to_text(const int event_type) {
  switch (event_type) {
    case 0:
      return "STATUS_ONLY";
    case 1:
      return "REMOTE_TRIGGER";
    case 2:
      return "SOS_BUTTON";
    case 3:
      return "LONG_STILL";
    case 4:
      return "USER_ACK";
    case 5:
      return "ACK_TIMEOUT";
    case 6:
      return "CLEAR_ALARM";
    case 7:
      return "NETWORK_LOST";
    case 8:
      return "NETWORK_RESTORED";
    case 9:
      return "POWER_BACKUP_ENTER";
    case 10:
      return "POWER_NORMAL_RESTORED";
    default:
      return "UNKNOWN";
  }
}

static const char *trigger_source_to_text(const int trigger_source) {
  switch (trigger_source) {
    case 0:
      return "LOCAL";
    case 1:
      return "REMOTE";
    case 2:
      return "BUTTON";
    case 3:
      return "RADAR";
    case 4:
      return "NETWORK";
    case 5:
      return "POWER";
    default:
      return "UNKNOWN";
  }
}

static const char *app_state_to_text(const int state) {
  switch (state) {
    case 0:
      return "NORMAL";
    case 1:
      return "NOTICE";
    case 2:
      return "ACK_WAIT";
    case 3:
      return "ALARM";
    case 4:
      return "NO_RESPONSE";
    case 5:
      return "CLEARED";
    default:
      return "UNKNOWN";
  }
}

static const char *event_result_to_text(const int result) {
  switch (result) {
    case 0:
      return "CREATED";
    case 1:
      return "WAITING_ACK";
    case 2:
      return "ACKNOWLEDGED";
    case 3:
      return "ESCALATED";
    case 4:
      return "CLEARED";
    case 5:
      return "OFFLINE_CACHED";
    case 6:
      return "BACKFILLED";
    case 7:
      return "FAILED";
    default:
      return "UNKNOWN";
  }
}

static const char *network_state_to_text(const int network_state) {
  switch (network_state) {
    case 0:
      return "ONLINE";
    case 1:
      return "OFFLINE";
    case 2:
      return "RESTORED";
    default:
      return "UNKNOWN";
  }
}

static const char *power_state_to_text(const int power_state) {
  switch (power_state) {
    case 0:
      return "NORMAL";
    case 1:
      return "BACKUP";
    case 2:
      return "LOW";
    default:
      return "UNKNOWN";
  }
}

static bool is_valid_enum_text(const char *value) {
  return value != nullptr && strcmp(value, "UNKNOWN") != 0;
}

static const char *risk_to_event(const int risk) {
  switch (risk) {
    case 0:
      return "normal";
    case 1:
      return "notice";
    case 2:
      return "warning";
    case 3:
      return "alarm";
    default:
      return "unknown";
  }
}

static const char *mask_state_text(const uint8_t relay_state_mask, const uint8_t relay_id) {
  const uint8_t bit = static_cast<uint8_t>(1U << (relay_id - 1U));
  return ((relay_state_mask & bit) != 0U) ? "ON" : "OFF";
}

static void publish_relay_state_from_mask(const uint8_t relay_id,
                                          const uint8_t relay_state_mask) {
  char payload[128];
  const char *state = mask_state_text(relay_state_mask, relay_id);
  const int written = snprintf(payload,
                               sizeof(payload),
                               "{\"node_id\":\"%s\",\"relay_id\":%u,\"state\":\"%s\","
                               "\"request_id\":null}",
                               NODE_ID,
                               relay_id,
                               state);

  if (written <= 0 || written >= static_cast<int>(sizeof(payload))) {
    Serial.println("[FAIL] relay state payload overflow");
    return;
  }

