MoeMengMoe/stm32-caring-system-project/esp8266_firmware/src/main.cpp
  mqtt_client.publish(mqtt_topic_relay_state[relay_id - 1U], payload, true);
}

static bool parse_event_frame(const char *line,
                              uint32_t *event_id,
                              int *scenario,
                              int *event_type,
                              int *trigger_source,
                              int *state_before,
                              int *state_after,
                              int *risk,
                              int *result,
                              int *network_state,
                              int *power_state,
                              uint32_t *flags,
                              uint32_t *timestamp_ms) {
  char frame_type = '\0';
  char extra = '\0';
  unsigned long parsed_event_id = 0;
  unsigned long parsed_flags = 0;
  unsigned long parsed_timestamp_ms = 0;

  const int fields = sscanf(
      line,
      " %c , %lu , %d , %d , %d , %d , %d , %d , %d , %d , %d , %lu , %lu %c",
      &frame_type,
      &parsed_event_id,
      scenario,
      event_type,
      trigger_source,
      state_before,
      state_after,
      risk,
      result,
      network_state,
      power_state,
      &parsed_flags,
      &parsed_timestamp_ms,
      &extra);

  if (fields != 13 || frame_type != 'E') {
    return false;
  }

  if (!is_valid_enum_text(scenario_to_text(*scenario)) ||
      !is_valid_enum_text(event_type_to_text(*event_type)) ||
      !is_valid_enum_text(trigger_source_to_text(*trigger_source)) ||
      !is_valid_enum_text(app_state_to_text(*state_before)) ||
      !is_valid_enum_text(app_state_to_text(*state_after)) ||
      *risk < 0 || *risk > 3 ||
      !is_valid_enum_text(event_result_to_text(*result)) ||
      !is_valid_enum_text(network_state_to_text(*network_state)) ||
      !is_valid_enum_text(power_state_to_text(*power_state))) {
    return false;
  }

  *event_id = static_cast<uint32_t>(parsed_event_id);
  *flags = static_cast<uint32_t>(parsed_flags);
  *timestamp_ms = static_cast<uint32_t>(parsed_timestamp_ms);
  return true;
}

static bool publish_event_json(const uint32_t event_id,
                               const int scenario,
                               const int event_type,
                               const int trigger_source,
                               const int state_before,
                               const int state_after,
                               const int risk,
                               const int result,
                               const int network_state,
                               const int power_state,
                               const uint32_t flags,
                               const uint32_t timestamp_ms) {
  char payload[MQTT_PAYLOAD_MAX_LEN];
  const int written = snprintf(
      payload,
      sizeof(payload),
      "{\"node_id\":\"%s\",\"event_id\":%lu,\"scenario\":\"%s\","
      "\"event_type\":\"%s\",\"trigger_source\":\"%s\",\"state_before\":\"%s\","
      "\"state_after\":\"%s\",\"risk\":%d,\"result\":\"%s\","
      "\"network_state\":\"%s\",\"power_state\":\"%s\",\"flags\":%lu,"
      "\"timestamp_ms\":%lu}",
      NODE_ID,
      static_cast<unsigned long>(event_id),
      scenario_to_text(scenario),
      event_type_to_text(event_type),
      trigger_source_to_text(trigger_source),
      app_state_to_text(state_before),
      app_state_to_text(state_after),
      risk,
      event_result_to_text(result),
      network_state_to_text(network_state),
      power_state_to_text(power_state),
      static_cast<unsigned long>(flags),
      static_cast<unsigned long>(timestamp_ms));

  if (written <= 0 || written >= static_cast<int>(sizeof(payload))) {
    Serial.println("[FAIL] MQTT event payload overflow");
    return false;
  }

  const bool ok = mqtt_client.publish(mqtt_topic_event, payload);
  Serial.print(ok ? "[INFO] Publish event OK: " : "[WARN] Publish event failed: ");
  Serial.println(payload);
  return ok;
}

static bool publish_status_json(const uint32_t seq,
                                const float temperature,
                                const float humidity,
                                const int gas,
                                const int presence,
                                const int risk,
                                const uint8_t relay_state_mask,
                                const uint8_t cloud_perm_mask) {
  char payload[MQTT_PAYLOAD_MAX_LEN];
  const int written = snprintf(
      payload,
      sizeof(payload),
      "{\"node_id\":\"%s\",\"seq\":%lu,\"temperature\":%.1f,\"humidity\":%.1f,"
      "\"gas\":%d,\"presence\":%d,\"risk\":%d,\"event\":\"%s\","
      "\"relay_state_mask\":%u,\"cloud_perm_mask\":%u}",
      NODE_ID,
      static_cast<unsigned long>(seq),
      temperature,
      humidity,
      gas,
      presence,
      risk,
      risk_to_event(risk),
      relay_state_mask,
      cloud_perm_mask);

  if (written <= 0 || written >= static_cast<int>(sizeof(payload))) {
    Serial.println("[FAIL] MQTT status payload overflow");
    return false;
  }

  const bool ok = mqtt_client.publish(mqtt_topic_status, payload);
  Serial.print(ok ? "[INFO] Publish status OK: " : "[WARN] Publish status failed: ");
  Serial.println(payload);

  if (ok) {
    for (uint8_t relay = 1; relay <= 4; relay++) {
      publish_relay_state_from_mask(relay, relay_state_mask);
    }
  }

  return ok;
}

static void send_link_ack(const uint32_t seq, const bool online) {
  const int rssi = (WiFi.status() == WL_CONNECTED) ? WiFi.RSSI() : -127;
  Serial.printf("A,%lu,%u,%d\r\n",
                static_cast<unsigned long>(seq),
                online ? 1U : 0U,
                rssi);
}

static bool parse_status_frame(const char *line,
                               uint32_t *seq,
                               float *temperature,
                               float *humidity,
                               int *gas,
                               int *presence,
                               int *risk,
                               uint8_t *relay_state_mask,
                               uint8_t *cloud_perm_mask) {
  char frame_type = '\0';
  char extra = '\0';
  unsigned long parsed_seq = 0;
  unsigned int parsed_relay_state_mask = 0;
  unsigned int parsed_cloud_perm_mask = 0;

  const int fields = sscanf(
      line,
      " %c , %lu , %f , %f , %d , %d , %d , %u , %u %c",
      &frame_type,
      &parsed_seq,
      temperature,
      humidity,
      gas,
      presence,
      risk,
      &parsed_relay_state_mask,
      &parsed_cloud_perm_mask,
      &extra);

