MoeMengMoe/stm32-caring-system-project/esp8266_firmware/src/main.cpp
  if (fields != 9 || frame_type != 'S') {
    return false;
  }

  if (*presence < 0 || *presence > 1 || *risk < 0 || *risk > 3 ||
      parsed_relay_state_mask > 15U || parsed_cloud_perm_mask > 15U) {
    return false;
  }

  *seq = static_cast<uint32_t>(parsed_seq);
  *relay_state_mask = static_cast<uint8_t>(parsed_relay_state_mask);
  *cloud_perm_mask = static_cast<uint8_t>(parsed_cloud_perm_mask);
  return true;
}

static bool parse_relay_result_frame(const char *line,
                                     uint32_t *request_id,
                                     uint8_t *relay_id,
                                     char *result,
                                     size_t result_size,
                                     char *state,
                                     size_t state_size,
                                     char *reason,
                                     size_t reason_size) {
  char frame_type = '\0';
  char extra = '\0';
  unsigned long parsed_request_id = 0;
  unsigned int parsed_relay_id = 0;
  char parsed_result[8] = {0};
  char parsed_state[8] = {0};
  char parsed_reason[24] = {0};

  const int fields = sscanf(line,
                            " %c , %lu , %u , %7[A-Z] , %7[A-Z] , %23[a-z_] %c",
                            &frame_type,
                            &parsed_request_id,
                            &parsed_relay_id,
                            parsed_result,
                            parsed_state,
                            parsed_reason,
                            &extra);

  if (fields != 6 || frame_type != 'R' || parsed_relay_id < 1U || parsed_relay_id > 4U) {
    return false;
  }

  if (strcmp(parsed_state, "ON") != 0 && strcmp(parsed_state, "OFF") != 0) {
    return false;
  }

  if (strcmp(parsed_result, "OK") != 0 && strcmp(parsed_result, "DENY") != 0 &&
      strcmp(parsed_result, "ERR") != 0) {
    return false;
  }

  *request_id = static_cast<uint32_t>(parsed_request_id);
  *relay_id = static_cast<uint8_t>(parsed_relay_id);

  strncpy(result, parsed_result, result_size - 1U);
  result[result_size - 1U] = '\0';
  strncpy(state, parsed_state, state_size - 1U);
  state[state_size - 1U] = '\0';
  strncpy(reason, parsed_reason, reason_size - 1U);
  reason[reason_size - 1U] = '\0';
  return true;
}

static bool publish_relay_result_json(const uint32_t request_id,
                                      const uint8_t relay_id,
                                      const char *result,
                                      const char *state,
                                      const char *reason) {
  char payload[160];
  const int written = snprintf(payload,
                               sizeof(payload),
                               "{\"node_id\":\"%s\",\"request_id\":%lu,\"relay_id\":%u,"
                               "\"result\":\"%s\",\"state\":\"%s\",\"reason\":\"%s\"}",
                               NODE_ID,
                               static_cast<unsigned long>(request_id),
                               relay_id,
                               result,
                               state,
                               reason);

  if (written <= 0 || written >= static_cast<int>(sizeof(payload))) {
    Serial.println("[FAIL] relay result payload overflow");
    return false;
  }

  const bool result_ok = mqtt_client.publish(mqtt_topic_relay_result[relay_id - 1U], payload);

  char state_payload[128];
  const int state_written = snprintf(state_payload,
                                     sizeof(state_payload),
                                     "{\"node_id\":\"%s\",\"relay_id\":%u,\"state\":\"%s\","
                                     "\"request_id\":%lu}",
                                     NODE_ID,
                                     relay_id,
                                     state,
                                     static_cast<unsigned long>(request_id));
  bool state_ok = false;
  if (state_written > 0 && state_written < static_cast<int>(sizeof(state_payload))) {
    state_ok = mqtt_client.publish(mqtt_topic_relay_state[relay_id - 1U], state_payload, true);
  } else {
    Serial.println("[FAIL] relay result state payload overflow");
  }

  Serial.print((result_ok && state_ok) ? "[INFO] Publish relay result OK: "
                                      : "[WARN] Publish relay result failed: ");
  Serial.println(payload);
  return result_ok && state_ok;
}

static void handle_uart_line(const char *line) {
  if (line == nullptr || line[0] == '\0') {
    return;
  }

  if (line[0] == 'S') {
    uint32_t seq = 0;
    float temperature = 0.0F;
    float humidity = 0.0F;
    int gas = 0;
    int presence = 0;
    int risk = 0;
    uint8_t relay_state_mask = 0;
    uint8_t cloud_perm_mask = 15;

    if (!parse_status_frame(line,
                            &seq,
                            &temperature,
                            &humidity,
                            &gas,
                            &presence,
                            &risk,
                            &relay_state_mask,
                            &cloud_perm_mask)) {
      Serial.print("[WARN] Invalid UART status frame: ");
      Serial.println(line);
      return;
    }

    if (has_last_uart_seq && seq <= last_uart_seq) {
      Serial.print("[WARN] UART status seq not increasing, seq=");
      Serial.println(seq);
    }
    last_uart_seq = seq;
    has_last_uart_seq = true;

    const bool published = publish_status_json(seq,
                                               temperature,
                                               humidity,
                                               gas,
                                               presence,
                                               risk,
                                               relay_state_mask,
                                               cloud_perm_mask);
    send_link_ack(seq, published && mqtt_client.connected());
    return;
  }

  if (line[0] == 'R') {
    uint32_t request_id = 0;
    uint8_t relay_id = 0;
    char result[8] = {0};
    char state[8] = {0};
    char reason[24] = {0};

