MoeMengMoe/stm32-caring-system-project/esp8266_firmware/src/main.cpp
    if (!parse_relay_result_frame(line,
                                  &request_id,
                                  &relay_id,
                                  result,
                                  sizeof(result),
                                  state,
                                  sizeof(state),
                                  reason,
                                  sizeof(reason))) {
      Serial.print("[WARN] Invalid UART relay result frame: ");
      Serial.println(line);
      return;
    }

    publish_relay_result_json(request_id, relay_id, result, state, reason);
    return;
  }

  if (line[0] == 'E') {
    uint32_t event_id = 0;
    int scenario = 0;
    int event_type = 0;
    int trigger_source = 0;
    int state_before = 0;
    int state_after = 0;
    int risk = 0;
    int result = 0;
    int network_state = 0;
    int power_state = 0;
    uint32_t flags = 0;
    uint32_t timestamp_ms = 0;

    if (!parse_event_frame(line,
                           &event_id,
                           &scenario,
                           &event_type,
                           &trigger_source,
                           &state_before,
                           &state_after,
                           &risk,
                           &result,
                           &network_state,
                           &power_state,
                           &flags,
                           &timestamp_ms)) {
      Serial.print("[WARN] Invalid UART event frame: ");
      Serial.println(line);
      return;
    }

    publish_event_json(event_id,
                       scenario,
                       event_type,
                       trigger_source,
                       state_before,
                       state_after,
                       risk,
                       result,
                       network_state,
                       power_state,
                       flags,
                       timestamp_ms);
    return;
  }

  Serial.print("[WARN] Unsupported UART frame: ");
  Serial.println(line);
}

static void poll_uart_frames(void) {
  while (Serial.available() > 0) {
    const char c = static_cast<char>(Serial.read());

    if (c == '\r') {
      continue;
    }

    if (c == '\n') {
      if (uart_line_len > 0) {
        uart_line[uart_line_len] = '\0';
        handle_uart_line(uart_line);
        uart_line_len = 0;
      }
      continue;
    }

    if (uart_line_len + 1 >= sizeof(uart_line)) {
      Serial.println("[WARN] UART line overflow, drop current line");
      uart_line_len = 0;
      continue;
    }

    uart_line[uart_line_len++] = c;
  }
}

static void publish_fake_status(void) {
  publish_status_json(fake_seq++, 25.6F, 61.0F, 120, 1, 0, 0U, 15U);
}

static bool topic_to_relay_id(const char *topic, uint8_t *relay_id) {
  if (topic == nullptr || relay_id == nullptr) {
    return false;
  }

  for (uint8_t relay = 1; relay <= 4; relay++) {
    if (strcmp(topic, mqtt_topic_relay_set[relay - 1U]) == 0) {
      *relay_id = relay;
      return true;
    }
  }

  return false;
}

static int command_type_to_code(const char *command_type) {
  if (strcmp(command_type, "TRIGGER_SCENARIO") == 0) {
    return 1;
  }
  if (strcmp(command_type, "USER_ACK") == 0) {
    return 2;
  }
  if (strcmp(command_type, "CLEAR_ALARM") == 0) {
    return 3;
  }
  if (strcmp(command_type, "SIMULATE_NETWORK") == 0) {
    return 4;
  }
  if (strcmp(command_type, "SET_RELAY") == 0) {
    return 5;
  }
  return -1;
}

static int scenario_to_code(const char *scenario) {
  if (strcmp(scenario, "NONE") == 0) {
    return 0;
  }
  if (strcmp(scenario, "SOS_OR_FALL_SIM") == 0) {
    return 1;
  }
  if (strcmp(scenario, "LONG_STILL_NO_RESPONSE") == 0) {
    return 2;
  }
  if (strcmp(scenario, "OFFLINE_AUTONOMY") == 0) {
    return 3;
  }
  return -1;
}

static bool extract_json_string_value(const char *payload,
                                      const char *key,
                                      char *out,
                                      size_t out_size) {
  if (payload == nullptr || key == nullptr || out == nullptr || out_size == 0U) {
    return false;
  }

  char pattern[32];
  snprintf(pattern, sizeof(pattern), "\"%s\"", key);
  const char *key_pos = strstr(payload, pattern);
  if (key_pos == nullptr) {
    return false;
  }

  const char *colon = strchr(key_pos + strlen(pattern), ':');
  if (colon == nullptr) {
    return false;
  }

  const char *value = colon + 1;
  while (*value == ' ' || *value == '\t') {
    value++;
  }

  if (*value == '"') {
    value++;
    const char *end = strchr(value, '"');
    if (end == nullptr) {
      return false;
    }
    const size_t len = static_cast<size_t>(end - value);
    if (len == 0U || len >= out_size) {
      return false;
    }
    memcpy(out, value, len);
    out[len] = '\0';
    return true;
  }

  size_t len = 0;
  while (value[len] != '\0' && value[len] != ',' && value[len] != '}' &&
         value[len] != ' ' && value[len] != '\t') {
    len++;
  }
  if (len == 0U || len >= out_size) {
    return false;
  }
  memcpy(out, value, len);
  out[len] = '\0';
  return true;
}

static bool parse_relay_set_payload(const char *payload,
                                    char *request_id,
                                    size_t request_id_size,
                                    char *action,
                                    size_t action_size) {
  if (payload == nullptr || request_id == nullptr || action == nullptr ||
      request_id_size == 0U || action_size == 0U) {
    return false;
  }

  request_id[0] = '\0';
  action[0] = '\0';

  if (strcmp(payload, "ON") == 0 || strcmp(payload, "OFF") == 0) {
    snprintf(request_id, request_id_size, "%lu", static_cast<unsigned long>(next_gateway_request_id++));
    strncpy(action, payload, action_size - 1U);
    action[action_size - 1U] = '\0';
    return true;
  }

  if (!extract_json_string_value(payload, "action", action, action_size)) {
    return false;
  }

  if (strcmp(action, "ON") != 0 && strcmp(action, "OFF") != 0) {
    return false;
  }

