MoeMengMoe/stm32-caring-system-project/esp8266_firmware/src/main.cpp
  if (!extract_json_string_value(payload, "request_id", request_id, request_id_size)) {
    snprintf(request_id, request_id_size, "%lu", static_cast<unsigned long>(next_gateway_request_id++));
  }

  for (size_t i = 0; request_id[i] != '\0'; i++) {
    if (request_id[i] < '0' || request_id[i] > '9') {
      snprintf(request_id, request_id_size, "%lu", static_cast<unsigned long>(next_gateway_request_id++));
      break;
    }
  }

  return true;
}

static bool parse_demo_command_payload(const char *payload,
                                       char *request_id,
                                       size_t request_id_size,
                                       int *command_type,
                                       int *scenario,
                                       int *value) {
  if (payload == nullptr || request_id == nullptr || command_type == nullptr ||
      scenario == nullptr || value == nullptr || request_id_size == 0U) {
    return false;
  }

  char command_type_text[24];
  char scenario_text[32];
  char value_text[12];

  if (!extract_json_string_value(payload, "command_type", command_type_text, sizeof(command_type_text))) {
    return false;
  }
  if (!extract_json_string_value(payload, "scenario", scenario_text, sizeof(scenario_text))) {
    strncpy(scenario_text, "NONE", sizeof(scenario_text) - 1U);
    scenario_text[sizeof(scenario_text) - 1U] = '\0';
  }
  if (!extract_json_string_value(payload, "value", value_text, sizeof(value_text))) {
    strncpy(value_text, "1", sizeof(value_text) - 1U);
    value_text[sizeof(value_text) - 1U] = '\0';
  }

  *command_type = command_type_to_code(command_type_text);
  *scenario = scenario_to_code(scenario_text);
  *value = atoi(value_text);
  if (*command_type < 0 || *scenario < 0) {
    return false;
  }

  if (!extract_json_string_value(payload, "request_id", request_id, request_id_size)) {
    snprintf(request_id, request_id_size, "%lu", static_cast<unsigned long>(next_gateway_request_id++));
  }

  for (size_t i = 0; request_id[i] != '\0'; i++) {
    if (request_id[i] < '0' || request_id[i] > '9') {
      snprintf(request_id, request_id_size, "%lu", static_cast<unsigned long>(next_gateway_request_id++));
      break;
    }
  }

  return true;
}

static void forward_relay_command_to_stm32(const uint8_t relay_id,
                                           const char *request_id,
                                           const char *action) {
  char frame[48];
  const int written = snprintf(frame, sizeof(frame), "C,%s,%u,%s\r\n", request_id, relay_id, action);
  if (written <= 0 || written >= static_cast<int>(sizeof(frame))) {
    Serial.println("[FAIL] relay command frame overflow");
    return;
  }

  Serial.print(frame);
}

static void forward_demo_command_to_stm32(const char *request_id,
                                          const int command_type,
                                          const int scenario,
                                          const int value) {
  char frame[48];
  const int written = snprintf(frame,
                               sizeof(frame),
                               "D,%s,%d,%d,%d\r\n",
                               request_id,
                               command_type,
                               scenario,
                               value);
  if (written <= 0 || written >= static_cast<int>(sizeof(frame))) {
    Serial.println("[FAIL] demo command frame overflow");
    return;
  }

  Serial.print(frame);
}

static void publish_demo_state(const char *request_id,
                               const int command_type,
                               const int scenario,
                               const int value,
                               const char *result) {
  char payload[160];
  const int written = snprintf(payload,
                               sizeof(payload),
                               "{\"node_id\":\"%s\",\"request_id\":%s,"
                               "\"command_type\":%d,\"scenario\":%d,"
                               "\"value\":%d,\"result\":\"%s\"}",
                               NODE_ID,
                               request_id,
                               command_type,
                               scenario,
                               value,
                               result);
  if (written <= 0 || written >= static_cast<int>(sizeof(payload))) {
    Serial.println("[FAIL] demo state payload overflow");
    return;
  }

  mqtt_client.publish(mqtt_topic_demo_state, payload, false);
}

static void on_mqtt_message(char *topic, byte *payload, unsigned int length) {
  uint8_t relay_id = 0;
  if (length + 1U > MQTT_PAYLOAD_MAX_LEN) {
    Serial.println("[WARN] MQTT payload too long");
    return;
  }

  char text[MQTT_PAYLOAD_MAX_LEN];
  memcpy(text, payload, length);
  text[length] = '\0';

  if (strcmp(topic, mqtt_topic_demo_command) == 0) {
    char request_id[16];
    int command_type = 0;
    int scenario = 0;
    int value = 0;

    if (!parse_demo_command_payload(text,
                                    request_id,
                                    sizeof(request_id),
                                    &command_type,
                                    &scenario,
                                    &value)) {
      Serial.print("[WARN] Invalid demo command payload: ");
      Serial.println(text);
      return;
    }

    forward_demo_command_to_stm32(request_id, command_type, scenario, value);
    publish_demo_state(request_id, command_type, scenario, value, "FORWARDED");
    return;
  }

  if (!topic_to_relay_id(topic, &relay_id)) {
    return;
  }

  char request_id[16];
  char action[8];
  if (!parse_relay_set_payload(text, request_id, sizeof(request_id), action, sizeof(action))) {
    Serial.print("[WARN] Invalid relay set payload: ");
    Serial.println(text);
    return;
  }

  forward_relay_command_to_stm32(relay_id, request_id, action);
}

static void subscribe_relay_topics(void) {
  for (uint8_t relay = 1; relay <= 4; relay++) {
    const bool ok = mqtt_client.subscribe(mqtt_topic_relay_set[relay - 1U]);
    Serial.print(ok ? "[INFO] Subscribed: " : "[WARN] Subscribe failed: ");
    Serial.println(mqtt_topic_relay_set[relay - 1U]);
  }
}

static void subscribe_gateway_topics(void) {
  subscribe_relay_topics();

  const bool ok = mqtt_client.subscribe(mqtt_topic_demo_command);
  Serial.print(ok ? "[INFO] Subscribed: " : "[WARN] Subscribe failed: ");
  Serial.println(mqtt_topic_demo_command);
}

static void connect_wifi(const unsigned long now) {
  if (WiFi.status() == WL_CONNECTED) {
    return;
  }

  if (wifi_begin_called && now - last_wifi_attempt_ms < WIFI_RETRY_INTERVAL_MS) {
    return;
  }

  last_wifi_attempt_ms = now;
  wifi_begin_called = true;

  Serial.print("[INFO] Connecting WiFi: ");
  Serial.println(WIFI_SSID);

  WiFi.mode(WIFI_STA);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
  Serial.println("[INFO] WiFi connection attempt started");
}

