MoeMengMoe/stm32-caring-system-project/esp8266_firmware/src/main.cpp
static void connect_mqtt(const unsigned long now) {
  if (WiFi.status() != WL_CONNECTED || mqtt_client.connected() ||
      now - last_mqtt_attempt_ms < MQTT_RETRY_INTERVAL_MS) {
    return;
  }

  last_mqtt_attempt_ms = now;
  Serial.printf("[INFO] Connecting MQTT: %s:%u\r\n", MQTT_HOST, MQTT_PORT);
  if (mqtt_client.connect(mqtt_client_id, mqtt_topic_availability, 0, true, "offline")) {
    Serial.println("[INFO] MQTT connected");
    mqtt_client.publish(mqtt_topic_availability, "online", true);
    subscribe_gateway_topics();
    return;
  }

  Serial.print("[WARN] MQTT connect failed, state=");
  Serial.println(mqtt_client.state());
}

static void maintain_connections(const unsigned long now) {
  if (WiFi.status() != WL_CONNECTED) {
    connect_wifi(now);
    return;
  }

  wifi_begin_called = false;
  connect_mqtt(now);
}

void setup() {
  Serial.begin(115200);
  delay(1000);

  build_mqtt_names();
  mqtt_client.setServer(MQTT_HOST, MQTT_PORT);
  mqtt_client.setCallback(on_mqtt_message);

  Serial.println();
  Serial.println("[INFO] ESP8266 MQTT UART gateway boot");
  Serial.println("[INFO] UART CSV formats: S,status E,event R,relay-result");
  Serial.println("[INFO] MQTT relay set and demo commands are forwarded as C/D frames");

  maintain_connections(millis());
}

void loop() {
  poll_uart_frames();
  const unsigned long now = millis();
  maintain_connections(now);
  if (mqtt_client.connected()) {
    mqtt_client.loop();
  }
  if (ENABLE_FAKE_DATA && now - last_publish_ms >= FAKE_PUBLISH_INTERVAL_MS) {
    last_publish_ms = now;
    publish_fake_status();
  }
}
